#+title: Emacs config
** Navigation

   #+BEGIN_SRC emacs-lisp :tangle yes
     ;; navigation


     ;; dump jump
     (use-package dumb-jump
       
       :after helm
       :bind (("M-g o" . dumb-jump-go-other-window)
              ("M-g j" . dumb-jump-go)
              ("M-g x" . dumb-jump-go-prefer-external)
              ("M-g z" . dumb-jump-go-prefer-external-other-window))
       :config
       (require 'helm)
       (setq dumb-jump-selector 'helm)
       (setq dumb-jump-prefer-searcher 'ag)
       ;; enable xref interface, add it to the end of the list
       (add-hook 'xref-backend-functions #'dumb-jump-xref-activate t)
       :init
       (dumb-jump-mode)
       )

     ;; avy
     (use-package avy
       
       :bind ("C-<" . avy-goto-word-1)) ;; changed from char as per jcs

     ;; hideshow
     ;; (require 'hideshow)
     ;; (add-hook 'prog-mode-hook 'hs-minor-mode)

     (use-package origami
       
       :hook (prog-mode . origami-mode)
       :config
       (define-key global-map
         (kbd "<f9>") 'origami-toggle-node))
   #+END_SRC

   #+RESULTS:
   | (lambda nil (interactive) (setq show-trailing-whitespace 1)) | clean-aindent-mode | highlight-indent-guides-mode | (lambda nil (display-line-numbers-mode t)) | display-line-numbers-mode | rainbow-delimiters-mode | origami-mode |


   
** ibuffer

   #+begin_src emacs-lisp :tangle yes
  ;; from centaur emacs
  (use-package ibuffer
    
    :init (setq ibuffer-filter-group-name-face '(:inherit (font-lock-string-face bold)))
    :config
    ;; Display icons for buffers
    (use-package all-the-icons-ibuffer
      
      :config
      (all-the-icons-ibuffer-mode 1))

    (with-eval-after-load 'helm
      (with-no-warnings
        (defun my-ibuffer-find-file ()
          (interactive)
          (let ((default-directory (let ((buf (ibuffer-current-buffer)))
                                     (if (buffer-live-p buf)
                                         (with-current-buffer buf
                                           default-directory)
                                       default-directory))))
            (helm-find-files default-directory)))
        (advice-add #'ibuffer-find-file :override #'my-ibuffer-find-file))))

  ;; Group ibuffer's list by project root
  (use-package ibuffer-projectile
    
    :functions all-the-icons-octicon ibuffer-do-sort-by-alphabetic
    :hook ((ibuffer . (lambda ()
                        (ibuffer-projectile-set-filter-groups)
                        (unless (eq ibuffer-sorting-mode 'alphabetic)
                          (ibuffer-do-sort-by-alphabetic)))))
    :config
    (setq ibuffer-projectile-prefix
          (concat
           (all-the-icons-octicon "file-directory"
                                  :face ibuffer-filter-group-name-face
                                  :v-adjust 0.0
                                  :height 1.0)
           " ")))
   #+end_src

   #+RESULTS:
   | lambda | nil | (ibuffer-projectile-set-filter-groups) | (unless (eq ibuffer-sorting-mode (quote alphabetic)) (ibuffer-do-sort-by-alphabetic)) |
   | lambda | nil | (ibuffer-projectile-set-filter-groups) | (if (eq ibuffer-sorting-mode (quote alphabetic)) nil (ibuffer-do-sort-by-alphabetic)) |
   |        |     |                                        |                                                                                       |
** Completion

   #+BEGIN_SRC emacs-lisp :tangle yes
          ;; completion
     (use-package company
  
       :preface (use-package company-tabnine )
       :config
       (global-company-mode 1)
       (setq company-show-numbers t)
       (setq company-idle-delay 0)
       (setq company-backends '((company-capf
                                 :sorted
                                 company-files
                                 company-dabbrev
                                 company-keywords
                                 company-yasnippet
                                 :separate
                                 company-tabnine)))
       (setq company-format-margin-function #'company-vscode-dark-icons-margin))


     ;; from centaur emacs
     ;; Better sorting and filtering
     (use-package company-prescient
  
       :init (company-prescient-mode 1))


     ;; ;; Icons and quickhelp
     ;; (use-package company-box
     ;;   :diminish
     ;;   :defines company-box-icons-all-the-icons
     ;;   :hook (company-mode . company-box-mode)
     ;;   :init (setq company-box-enable-icon t
     ;;               company-box-backends-colors nil
     ;;               company-box-doc-enable nil)
     ;;   :config
     ;;   (with-no-warnings
     ;;     ;; Prettify icons
     ;;     (defun my-company-box-icons--elisp (candidate)
     ;;       (when (or (derived-mode-p 'emacs-lisp-mode) (derived-mode-p 'lisp-mode))
     ;;         (let ((sym (intern candidate)))
     ;;           (cond ((fboundp sym) 'Function)
     ;;                 ((featurep sym) 'Module)
     ;;                 ((facep sym) 'Color)
     ;;                 ((boundp sym) 'Variable)
     ;;                 ((symbolp sym) 'Text)
     ;;                 (t . nil)))))
     ;;     (advice-add #'company-box-icons--elisp :override #'my-company-box-icons--elisp))

     ;;   (when (icons-displayable-p)
     ;;     (declare-function all-the-icons-faicon 'all-the-icons)
     ;;     (declare-function all-the-icons-material 'all-the-icons)
     ;;     (declare-function all-the-icons-octicon 'all-the-icons)
     ;;     (setq company-box-icons-all-the-icons
     ;;           `((Unknown . ,(all-the-icons-material "find_in_page" :height 0.8 :v-adjust -0.15))
     ;;             (Text . ,(all-the-icons-faicon "text-width" :height 0.8 :v-adjust -0.02))
     ;;             (Method . ,(all-the-icons-faicon "cube" :height 0.8 :v-adjust -0.02 :face 'all-the-icons-purple))
     ;;             (Function . ,(all-the-icons-faicon "cube" :height 0.8 :v-adjust -0.02 :face 'all-the-icons-purple))
     ;;             (Constructor . ,(all-the-icons-faicon "cube" :height 0.8 :v-adjust -0.02 :face 'all-the-icons-purple))
     ;;             (Field . ,(all-the-icons-octicon "tag" :height 0.85 :v-adjust 0 :face 'all-the-icons-lblue))
     ;;             (Variable . ,(all-the-icons-octicon "tag" :height 0.85 :v-adjust 0 :face 'all-the-icons-lblue))
     ;;             (Class . ,(all-the-icons-material "settings_input_component" :height 0.8 :v-adjust -0.15 :face 'all-the-icons-orange))
     ;;             (Interface . ,(all-the-icons-material "share" :height 0.8 :v-adjust -0.15 :face 'all-the-icons-lblue))
     ;;             (Module . ,(all-the-icons-material "view_module" :height 0.8 :v-adjust -0.15 :face 'all-the-icons-lblue))
     ;;             (Property . ,(all-the-icons-faicon "wrench" :height 0.8 :v-adjust -0.02))
     ;;             (Unit . ,(all-the-icons-material "settings_system_daydream" :height 0.8 :v-adjust -0.15))
     ;;             (Value . ,(all-the-icons-material "format_align_right" :height 0.8 :v-adjust -0.15 :face 'all-the-icons-lblue))
     ;;             (Enum . ,(all-the-icons-material "storage" :height 0.8 :v-adjust -0.15 :face 'all-the-icons-orange))
     ;;             (Keyword . ,(all-the-icons-material "filter_center_focus" :height 0.8 :v-adjust -0.15))
     ;;             (Snippet . ,(all-the-icons-material "format_align_center" :height 0.8 :v-adjust -0.15))
     ;;             (Color . ,(all-the-icons-material "palette" :height 0.8 :v-adjust -0.15))
     ;;             (File . ,(all-the-icons-faicon "file-o" :height 0.8 :v-adjust -0.02))
     ;;             (Reference . ,(all-the-icons-material "collections_bookmark" :height 0.8 :v-adjust -0.15))
     ;;             (Folder . ,(all-the-icons-faicon "folder-open" :height 0.8 :v-adjust -0.02))
     ;;             (EnumMember . ,(all-the-icons-material "format_align_right" :height 0.8 :v-adjust -0.15))
     ;;             (Constant . ,(all-the-icons-faicon "square-o" :height 0.8 :v-adjust -0.1))
     ;;             (Struct . ,(all-the-icons-material "settings_input_component" :height 0.8 :v-adjust -0.15 :face 'all-the-icons-orange))
     ;;             (Event . ,(all-the-icons-octicon "zap" :height 0.8 :v-adjust 0 :face 'all-the-icons-orange))
     ;;             (Operator . ,(all-the-icons-material "control_point" :height 0.8 :v-adjust -0.15))
     ;;             (TypeParameter . ,(all-the-icons-faicon "arrows" :height 0.8 :v-adjust -0.02))
     ;;             (Template . ,(all-the-icons-material "format_align_left" :height 0.8 :v-adjust -0.15)))
     ;;           company-box-icons-alist 'company-box-icons-all-the-icons)))




     ;;Popup documentation for completion candidates
     ;; (use-package company-quickhelp
     ;;   
     ;;   :defines company-quickhelp-delay
     ;;   :bind (:map company-active-map
     ;;               ([remap company-show-doc-buffer] . company-quickhelp-manual-begin))
     ;;   :hook (global-company-mode . company-quickhelp-mode)
     ;;   :init (setq company-quickhelp-delay 0.5))

   #+END_SRC

   #+RESULTS:
   | company-box-mode | company-mode-set-explicitly |
** lsp

   #+begin_src emacs-lisp :tangle yes
     ;; (defun efs/lsp-mode-setup ()
;;   (setq lsp-headerline-breadcrumb-segments '(symbols))
;;   (lsp-headerline-breadcrumb-mode))

;; (use-package lsp-mode
;;   :commands (lsp lsp-deferred)
;;   :hook (lsp-mode . efs/lsp-mode-setup)
;;   :init
;;   (setq lsp-keymap-prefix "C-c l")  ;; Or 'C-l', 's-l'
;;   (setq lsp-enable-indentation t
;;         lsp-semantic-tokens-enable nil
;;         lsp-auto-guess-root t
;;         lsp-prefer-flymake nil)
;;   :config
;;   (lsp-enable-which-key-integration t))


;; (use-package dap-mode
;;   )

;; (use-package lsp-ui
;;   
;;   :hook (lsp-mode . lsp-ui-mode)
;;   :custom
;;   (lsp-ui-doc-enable t)
;;   (lsp-ui-doc-show-with-cursor t)
;;   (lsp-ui-doc-show-with-mouse nil)
;;   (lsp-ui-doc-position 'bottom)
;;   (lsp-ui-doc-header nil)
;;   (lsp-ui-doc-include-signature t)
;;   (lsp-ui-doc-alignment 'window)
;;   (lsp-ui-doc-max-width 100)
;;   (lsp-ui-doc-max-height 13)
;;   (lsp-ui-doc-delay 2))

;; (use-package helm-lsp
;;   
;;   :config
;;   (define-key lsp-mode-map [remap xref-find-apropos] #'helm-lsp-workspace-symbol))


;; ;; LSP with C++
;; (add-hook 'c++-mode-hook 'lsp-deferred)

;; (defun my-lsp-c++-hook ()
;;   "Configure clangd as C++ backend for lsp"
;;   (setq lsp-clients-clangd-executable my-clangd-executable
;;         lsp-clients-clangd-args (list (concat "--query-driver=" llvm-root "**") "-background-index" "--log=verbose" "--folding-ranges")))

;; (add-hook 'lsp-mode 'my-lsp-c++-hook)

;; (add-hook 'c++-mode-hook (lambda ()
;;                            (require 'dap-cpptools)))
#+end_src

#+RESULTS:
| (lambda nil (require (quote dap-cpptools))) | lsp-deferred | my-select-clangcheck-for-checker | ess-roxy-enable-in-cpp | c-c++-company-setup | modern-c++-font-lock-mode | eglot-ensure | er/add-cc-mode-expansions | helm-gtags-mode | turn-on-function-args-mode |

